[{"id":"237d43db-82db-80aa-8a81-cec335b2c3a1","notion_id":"237d43db-82db-80aa-8a81-cec335b2c3a1","jobType":{"slug":"full-time","name":"Full time"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"","companyName":"Clerk","relation_notableProjects":["237d43db-82db-80f9-b263-c62fc9965c12"],"yearsActive":"2024 — Current","testimonial":"","title":"Sr Developer Educator","slug":"sr-developer-educator","logo":["/img/n/sr-developer-educator/7974b1b4-a794-4289-b04f-f89d3eedd2b2-primary-full.png"],"html":"<div><p>As a Sr Developer Educator at Clerk, I am primarily responsible for contributing and manage submissions from others to the Clerk blog, consistently maintaining the highest quality bar possible to guide developers to understand how to best utilize Clerk in their projects. I also foster relationship with other dev tool companies to identify potential collaboration opportunities as well as interface with customers on social media to help assist them with trouble using Clerk.</p><p></p></div>","excerpt":"As a Sr Developer Educator at Clerk, I am primarily responsible for contributing and manage submissions from others t...","cachedOn":1753130581},{"id":"0978e1d3-dc41-4f83-b574-2311046bde51","notion_id":"0978e1d3-dc41-4f83-b574-2311046bde51","jobType":{"slug":"full-time","name":"Full time"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"Holly Guevara, VP Developer Marketing","companyName":"PlanetScale","relation_notableProjects":["4c1a58fe-09d8-4a7e-afbc-5788cd43a93e","28731d13-9e43-4ecb-aaed-2bbaf59e8844","0ed8dcb3-2de4-4b1b-a757-f32fc423f243","5182b74b-a962-4c8a-8e25-394adb2dd064"],"yearsActive":"2022 — 2024","testimonial":"I directly managed Brian for nearly 2 two years. He was the first Developer Educator that I hired at PlanetScale and was directly responsible for much of the Marketing growth that PlanetScale experienced over the past two years. He possesses a unique skill set that is truly invaluable at any company. His expertise in content creation, documentation, programming, and understanding of marketing/sales positions him as an incredible fit for any DevEd/DevRel team. The true differentiator with Brian is his eagerness to make a difference and his incredible work ethic. He is truly the hardest working individual I've had the pleasure of managing. If you are looking for someone that can hit the ground running and make a huge impact on the company, Brian is your guy.","title":"Developer Educator","slug":"developer-educator","logo":["/img/n/developer-educator/b986f922-ad72-44e0-a7d3-d36484003655-Capture-2023-06-21-150700.png"],"html":"<div><p>As a Developer Educator at PlanetScale, my primary focus is creating content that helps developers and users who are new to PlanetScale quickly and easily get familiarized with the platform. This includes:</p><ul><li>Managing the documentation and ensuring the docs are accurate based on new features being engineered</li><li>Creating technical blog articles to demonstrate why someone would want to use our platform or MySQL over alternative products</li><li>Record and produce video tutorials for our YouTube channel among other social media platforms</li><li>Assist in reviewing contributed articles for technical and grammatical accuracy</li><li>Work on various open source projects that helps developers using the platform</li></ul><p></p><p>Notable projects are:</p><ul><li>A revamped onboarding section for the docs</li><li>Building the first official PlanetScale GitHub Actions</li><li>Creating a new documentation section demonstrating how PlanetScale can be utilized in CI/CD pipelines</li></ul><p></p></div>","excerpt":"As a Developer Educator at PlanetScale, my primary focus is creating content that helps developers and users who are ...","cachedOn":1753130501},{"id":"e3fce409-1678-476b-be17-fd4a21b54df4","notion_id":"e3fce409-1678-476b-be17-fd4a21b54df4","jobType":{"slug":"contractor","name":"Contractor"},"testimonialAuthor":"","companyName":"LaunchCode","relation_notableProjects":[],"yearsActive":"2020 — 2021","testimonial":"","title":"Teaching Assistant","slug":"teaching-assistant","html":"<div></div>","excerpt":"","cachedOn":1687812615},{"id":"bb9aaa10-77f7-4937-9e5a-acc2a43a9026","notion_id":"bb9aaa10-77f7-4937-9e5a-acc2a43a9026","jobType":{"slug":"contractor","name":"Contractor"},"testimonialAuthor":"","companyName":"Hylio LLC","relation_notableProjects":[],"yearsActive":"2020","testimonial":"","title":"Frontend Developer","slug":"frontend-developer","html":"<div></div>","excerpt":"","cachedOn":1687812617},{"id":"b6f6ed05-a879-43b2-b76c-e3f5df82dda4","notion_id":"b6f6ed05-a879-43b2-b76c-e3f5df82dda4","jobType":{"slug":"full-time","name":"Full time"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"","companyName":"Temeda LLC","relation_notableProjects":["5eb72b62-92bf-4d80-9c8d-f047d5996f8f","8abb41f7-483e-4ef5-b839-a43d7dd35bc2","b05f66c4-b037-4198-9b74-bc287c28acf9","e2d61cde-df43-4ccf-8618-5ddd42fe8278","cb245da1-fec4-4d96-9a70-6593b9c2d2f0"],"yearsActive":"2019 — 2022","testimonial":"","title":"Lead Backend Developer","slug":"lead-backend-developer","logo":["/img/n/lead-backend-developer/22475bed-2d6d-4adb-b9a0-a714ed37058d-Capture-2023-06-21-150017.png"],"html":"<div><p>I started at Temeda as a Senior Fullstack Developer and quickly moved into the Lead Backend Developer role. I worked on both the API built in .NET, and the front end application built with a combination of React & AngularJS. I also work on various integrations with vendors and clients as needed, and act as a resource to assist with designing architecture in Azure.</p><p>Some notable projects;</p><ul><li>Clusterpoints</li><li>Dynamic Query</li><li>Inspections Feature</li><li>Multi-Account User Switching</li><li>Implementing a container DevOps pipeline</li></ul><p></p></div>","excerpt":"I started at Temeda as a Senior Fullstack Developer and quickly moved into the Lead Backend Developer role. I worked ...","cachedOn":1753130501},{"id":"0ba85558-e569-4bec-a3b3-0db8d502bb70","notion_id":"0ba85558-e569-4bec-a3b3-0db8d502bb70","jobType":{"slug":"full-time","name":"Full time"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"John Zei, Senior Director of IT Services","companyName":"LeSaint Logistics","relation_notableProjects":["0dea3ab8-bb37-460f-9a30-d2f011642623","51b41b72-e5ae-488a-845b-ece712773014","1dc9592d-1bfd-4663-a9ce-b7946db381c9"],"yearsActive":"2015 — 2019","testimonial":"Brian is always educating himself to become better technically and organizationally. What this means to an employer or client is that he is going to find the best solution for your need and execute successfully on time. He did this consistently for me which made him a productive, reliable high performer.\n\nBrian was promoted multiple times and demonstrated his wide range of talents in both network/systems engineering and software development. His broad experience background allows him to be more creative and effective.","title":"API Developer, Sr Systems Engineer","slug":"api-developer-sr-systems-engineer","logo":["/img/n/api-developer-sr-systems-engineer/a73ba1a9-ead5-4d3f-9ab5-fc9ade4e5ae3-lesaint.webp"],"html":"<div><p>In 2015, I joined LeSaint Logistics as a Systems Engineer with a focus with assisting help desk support, as well as maintaining a datacenter & network of 20 warehouses across the US. I was quickly promoted to Senior Systems Engineer where I was put in charge of managing projects as related to the IT Operations department and ensuring successful execution of these projects in a timely manner. Some of my notable systems projects are;</p><ul><li>Migrating 1500+ users from an on-premise exchange environment to Office 365</li><li>Upgrading our Fiber SAN, including replication to a backup DC at a different warehouse</li><li>Implementing a ShoreTel VOIP system</li></ul><p>As with my role at Systech, I also worked on smaller software development projects on the side to assist in automating various parts of the department. These included;</p><ul><li>A Windows Server Update utility</li><li>A redesigned portal for external users</li><li>A system that automates onboarding new employees</li></ul><p>In early 2018, our in-house developer left the company and I was offered the position of Software Engineer due to my successful side-projects in the organization. I was given the responsibility of onboarding new integration customers, facilitating a successful integration and extending the functionality of our .NET API as needed, all while retaining my responsibilities as a Senior Systems Engineer while a my replacement could be found.</p><p>In 2019, I decided I wanted to focus my career on software development & cloud infrastructure, so I obtained my AWS certifications as a Solutions Architect & Developer, both Associate level certifications.</p></div>","excerpt":"In 2015, I joined LeSaint Logistics as a Systems Engineer with a focus with assisting help desk support, as well as m...","cachedOn":1753130504},{"id":"1df62840-3545-47c1-98b8-7addf339d2ac","notion_id":"1df62840-3545-47c1-98b8-7addf339d2ac","jobType":{"slug":"full-time","name":"Full time"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"Jack Prager, President","companyName":"Systech Information Services","relation_notableProjects":["fd4782ee-c24c-4195-b254-32827291bb0d","776703c6-aac9-428d-9a56-f6e866c3bc14","6dc2d67c-0bf5-4b7d-aa19-80bafa7599fe","5ca1e211-c17a-4878-9af2-b0fd3a645e13","120e2133-e6bd-4338-8a0e-27d63ee8861f"],"yearsActive":"2013 — 2015","testimonial":"I had the pleasure of working with Brian at Systech. We at Systech are an IT Managed services provider. During Brian's engagement with us we had required customized software on many occasions. Brian was easy to work with and listened well to our needs and the customer's needs and was able to boil down those needs into a deliverable software solution. I would recommend Brian for any of your software programming requirements.","title":"Network Engineer","slug":"network-engineer","logo":["/img/n/network-engineer/eb53f6bf-50a1-483f-af5e-70c5902f7877-Capture-2023-06-21-145923.png"],"html":"<div><p>I joined Systech in 2013 as a Network Engineer, it was a job very similar to my own company where the daily requirements were very dynamic. I was constantly working with new and interesting technologies as required by our customers. My primary focuses were;</p><ul><li>Repairing computers & servers</li><li>Provisioning new machines & networking equipment</li><li>Managing Office 365 tenants</li><li>Pretty much anything that was requested by our clients</li></ul><p>Midway through my tenure at Systech, my role was changed to focus specifically on onboarding new clients into our system. I designed a project template that was used on a number of clients to ensure that all of the required hardware & software were correctly procured, configured, and deployed to the client site.</p><p>Through all of this, I had a secondary focus of building applications for internal use, and for several clients.</p><p></p></div>","excerpt":"I joined Systech in 2013 as a Network Engineer, it was a job very similar to my own company where the daily requireme...","cachedOn":1753130505},{"id":"5e703996-2e08-4cfc-a56d-082087007754","notion_id":"5e703996-2e08-4cfc-a56d-082087007754","jobType":{"slug":"self-employed","name":"Self employed"},"visibility":{"slug":"public","name":"Public"},"testimonialAuthor":"","companyName":"Onyx Computer Repair","relation_notableProjects":["b9ec4188-4abf-49b9-9a51-ea7ceaa442c6","36afe066-973d-4e3e-9c86-2151e8af81e4"],"yearsActive":"2008 — 2012","testimonial":"","title":"Owner","slug":"owner","logo":["/img/n/owner/58b40b86-f683-4632-91f3-994b437303b9-onyx.png"],"html":"<div><p>I started working at a big box retailer as a computer repair specialist before leaving to start my own company focusing on computer repair, networking, and general systems configuration. I worked with individuals as well as business to help solve computer-related issues, regardless of the scale. I also built several websites and applications during this time.</p><p>In 2013, my now wife and I were getting serious about starting a life together, so I made the decision to move away from being a solopreneur to getting a job for more steady income.</p><p></p></div>","excerpt":"I started working at a big box retailer as a computer repair specialist before leaving to start my own company focusi...","cachedOn":1753130506}]